[
  {
    "category": "期刊論文",
    "content": [
      "C.-H. Lin, C.-Y. Li and K.C. Wang, 2018, 12, “Setting Malicious Flow Entries against SDN Operations: Attacks and Countermeasures,” in Proc. IEEE Conference on Dependable and Secure Computing (DSC).",
      "Y.H. Hsueh, C.-Y. Li and K.C. Wang, 2018, 08, “WiGig Sector-based Fingerprinting for Drone Indoor Positioning” in Proc.  IEEE Vehicular Technology Society Asia Pacific Wireless Communications Symposium, pp. 1-2.",
      "T.H. Chen, C.-Y. Li and K.C. Wang, 2018, 08, “Sensor-Assisted Beam Adaptation for WiGig Mobility Support,” in Proc.  IEEE Vehicular Technology Society Asia Pacific Wireless Communications Symposium, pp. 1-2. ",
      "Y.K. Gao, K.C. Wang, B.H. Li, 2018, 08, “Load Balancing in Fog Computing Environments Using Association Control,” in Proc. 23th Mobile Computing Workshop, pp. 1-6.",
      "G.-C. Deng and K.C. Wang, 2018, 06, “An Application-aware QoS Routing Algorithm for SDN-based IoT Networking,” in Proc. 22th IEEE Symposium on Computers and Communications (ISCC), pp. 1-6.",
      "Y.-T. Chen C.-Y. Li and K.C. Wang, 2018, 06, “A Fast Converging Mechanism for Load Balancing Among SDN Multiple Controllers,” in Proc. 22th IEEE Symposium on Computers and Communications (ISCC), pp. 1-6.",
      "T. Cheng, K.C. Wang, L-C. Wang and C-W. Lee, 2018, 05, “An In-Switch Rule Caching and Replacement Algorithm in Software Defined Networks,” in Proc. IEEE International Conference on Communications (ICC), pp. 1-6.",
      "A. Iskandar, K.C. Wang, and W.C. Su, 2018, 01, “A Low Delay Virtual Load Balancer in Software-Defined Networks,” in Proc. NST, pp. 1-5.",
      "Y.-Y. Li, C.-Y. Li, W.-H. Chen, C.-J. Yeh and K.C. Wang, 2017, 10, “Enabling Seamless WiGig/WiFi Handovers in Tri-band Wireless Systems,” in Proc. IEEE 25th International Conference on Network Protocols (ICNP), pp. 1-2.",
      "J.-J. Wang, C.-H. Hung, L.-C. Wang, K.C. Wang, and C.-W. Lee, 2017, 10, “High-Efficiency Matching Mechanism for Off-Chip Tables in OpenFlow-enabled Legacy Switch,” in Proc. IEEE 28th Annual International Symposium on Personal, Indoor, and Mobile Radio Communications (PIMRC), pp. 1-5.",
      "R. Rani, K.C. Wang, Y.K. Gao, 2017, 08, “Collaborative Filtering for Prediction of Disease Risk,” in Proc. 22th Mobile Computing Workshop, pp. 1-6.",
      "C. Lin, K.C. Wang, G. Deng, 2017, 07, “A QoS-aware Routing in SDN Hybrid Networks,” in Proc 12th International Conference on Future Networks and Communications (FNC), pp. 242-249.",
      "T.-Y. Chao, K.C. Wang, L-C. Wang and C-W. Lee, 2017, 05, “In-Switch Dynamic Flow Aggregation in Software Defined Networks,” in Proc. IEEE International Conference on Communications (ICC), pp. 1-6.",
      "G.-R. Chen, C.-Y. Li and K.C. Wang, 2017, 05, “ReSDN: A Lightweight Solution for Data-plane State Recovery in Software-defined Networks,” in Proc. IEEE International Conference on Communications (ICC), pp. 1-7.",
      "H. Mizuardy, K.C. Wang and G.C. Deng, 2017, 01, “A Low Delay Virtualized Routing Function in SDN Networks,” in Proc. NST, pp. 1-5.",
      "H.E. Lien, K.C. Wang and Y.H. Hsu, 2016, 08, “A Dynamic Resource Allocation Algorithm with Minimum Energy Consumption,” in Proc. 21th Mobile Computing Workshop, pp. 1-5.",
      "Y.-L. Lan, K.C. Wang and Y.-H. Hsu, 2016, 07, “Dynamic Load-balanced Path Optimization in SDN-based Data Center Networks,” in Proc. 10th International Symposium on Communication Systems, Networks and Digital Signal Processing (CSNDSP),” pp. 1-6.",
      "T.-H. Tsai, K.C. Wang, and T.-Y. Chao, 2016, 07, “Dynamic Flow Aggregation in SDNs for Application-aware Routing,” in Proc. 10th International Symposium on Communication Systems, Networks and Digital Signal Processing (CSNDSP),” pp. 1-5.",
      "K.-C. Fang, K.C. Wang and J.-H. Wang, 2016, 07, “A Fast and Load-aware Controller Failover Mechanism for Software-defined Networks,” in Proc. 10th International Symposium on Communication Systems, Networks and Digital Signal Processing (CSNDSP),” pp. 1-6.",
      "T.-W. Yang, K.C. Wang, 2016, 04, “Failure Detection Service with Low Mistake Rates for SDN Controllers,” in Proc. 18th Asia-Pacific Network Operations and Management Symposium (APNOMS), pp. 1-6.",
      "C.-C. Ho, K.C. Wang and Y.-H. Hsu, 2016, 01, “A Fast Consensus Algorithm for Multiple Controllers in Software-defined Networks,” in Proc. 18th International Conference on Advanced Communication Technology (ICACT), pp. 1-5. (Received an Outstanding Paper Award)",
      "T.S. Lin, K.C. Wang and Y.H. Hsu, 2015, 08, “Energy-Aware Load Balancing for Distributed SDN Controllers,” in Proceedings of 20th Mobile Computing Workshop, pp. 1-5.",
      "Y.H. Hsu and K. C. Wang, “Energy-efficient Load Balancing for Green LTE-A Self-Organizing Networks,” in Proc. IEEE International Conference on Ubiquitous and Future Networks (ICUFN), July 2015.",
      "L.-C. Cheng, K. C. Wang. and Y.H. Hsu, “Application-aware Routing Scheme for SDN-based Cloud Datacenters,” in Proc. IEEE International Conference on Ubiquitous and Future Networks (ICUFN), July 2015.",
      "Y. C. Chan, K. C. Wang, and Y.H. Hsu, “Fast Controller Failover for Multi-domain Software-Defined Networks ” in Proc. IEEE European Conference on Networks and Communications (EuCNC), 2015.",
      "Y. C. Lei, K. C. Wang, and Y.H. Hsu, “Multipath Routing in SDN-based Data Center Networks” in Proc. IEEE European Conference on Networks and Communications (EuCNC), 2015.",
      "L.S. Lee, K.C. Wang and Y.H. Hsu, 2015, 04, “A Dynamic MBS Zone Framework for Cost-Effective Inter-MBS Zone Handover in WiMAX Networks,” Telecommunication Systems. (SCI, EI)",
      "T. F. Yu, K. C. Wang, and Y.H. Hsu, “Adaptive Routing for Video Streaming with QoS Support over SDN Networks” in Proc. IEEE International Conference on Information Networking, Jan. 2015.",
      "Y. C. Chang, K. C. Wang, and Y.H. Hsu, “Dynamic Resource Provisioning with Hotspot Anticipation for MMOG Clouds,” in Proc. International Computer Symposium, Dec. 2014.",
      "H. N. Ye, K. C. Wang, R. H. Jan, Y. J. Hu, Y. C. Tseng, and Y.H. Hsu, “A Fast Window-based Scalar Multiplication Algorithm for Elliptic Curve Cryptography in Wireless Sensor Networks,” in Proc. International Computer Symposium, Dec. 2014.",
      "T. C. Liu,K. C. Wang, C. Y. Ku and Y. H. Hsu, 2014, 08, “QoS-aware Resource Management for Multimedia Traffic Report Systems over LTE,“ in Proceedings of the Tenth Workshop on Wireless, Ad Hoc and Sensor Networks, pp. 1-5.",
      "Y.H. Hsu, K.C. Wang and Y.-C. Tseng, 2014, 11, “Efficient Cooperative Access Class Barring with Load Balancing and Traffic Adaptive Radio Resource Management for M2M Communications over LTE-A,” Computer Networks, Vol. 73, pp. 268–281. (SCI, EI)",
      "K.C. Wang, C.-Y. Huang, L.-Y. Tsai and Y.-D. Lin, 2014, 11, “Behavior-based Botnet Detection in Parallel,” Security and Communication Networks, Vol. 7, Iss. 11, pp. 1849–1859. (SCI, EI)",
      "C.-C. Li and K.C. Wang, 2014, 02, “An SLA-aware Load Balancing Scheme for Cloud Datacenters,” in Proceedings of the International Conference on Information Networking, pp. 1-6.",
      "W.F Hong, K.C. Wang and Y.H. Hsu, 2013, 12, “Application-aware Resource Allocation for SDN-based Cloud Datacenters,“ in Proceedings of the 2013 International Conference on Cloud Computing and Big Data, pp. 1-5.",
      "Y.H. Hsu, K.C. Wang and Y.-C. Tseng, 2013, 11, “Enhanced Cooperative Access Class Barring and Traffic Adaptive Radio Resource Management for M2M Communications over LTE-A,” in Proceedings of the APSIPA Annual Summit and Conference, pp. 1-6.",
      "C.H. Chen, K.C. Wang and Y.H. Hsu, 2013, 08, “An Efficient Resource Provisioning for MMOG Clouds Considering AFK Players,“ in Proceedings of 18th Mobile Computing Workshop, pp. 1-6. (received the Best Paper Award)",
      "Z.-L. Wu, K.C. Wang and Y.H. Hsu, 2013, 08, “SVM-based Load Prediction for Resource Allocation in MMOG Clouds,“ in Proceedings of 18th Mobile Computing Workshop, pp. 1-5.",
      "C.-C. Chang, K.C. Wang and Y.H. Hsu, 2013, 08, “A Traffic Light Based Reliable Routing Protocol for Urban VANETs,” in Proceedings of the Ninth Workshop on Wireless, Ad Hoc and Sensor Networks, pp. 1-6.",
      "Y.L. Hsieh and K.C. Wang, 2012, 12 “A Road-based QoS-aware Multipath Routing for Urban Vehicular Ad Hoc Networks,” in Proceedings of the IEEE Globecom, pp. 1-6.",
      "S.F. Yang, T.H. Ku, A.K. Jeng, R.H. Jan, Y.C. Tseng, K.C. Wang and Y.J. Hu, 2012, 12 \"iPCA: An Integration Information System for Patient Controlled Analgesia using Wireless Techniques,\" International Journal of Ad Hoc and Ubiquitous Computing. (SCI) ",
      "Y.L. Hsieh and K.C. Wang, 2012, 11, “Dynamic Overlay Multicast for Live Multimedia Streaming in Urban VANETs,” Computer Networks, Vol. 56, pp. 3609-3628. (SCI, EI)",
      "C.F. Weng and K.C. Wang, 2012, 08, “Dynamic Resource Allocation for MMOGs in Cloud Computing Environments,” in Proceedings of the 7th International Conference on Wireless Communications and Mobile Computing (IEEE IWCMC). ",
      "K.Y. Chung, K.C. Wang and Y.L. Hsieh, 2012, 08, “Road-based Multipath Routing in Urban VANETs,” in Proceedings of the Eighth Workshop on Wireless, Ad Hoc and Sensor Networks.",
      "Y.-J Hu, R.-H. Jan, K.C. Wang, Y.-C. Tseng, T.-H. Ku and S.-F., Yang, 2012, 07,  “Characterizing Postoperative Pain Management Data by Cluster Analysis,” in Proceedings of the 2012 World Congress in Computer Science, Computer Engineering, and Applied Computing.",
      "G. Wang and K.C. Wang, 2012, 02, “An Efficient Hybrid P2P MMOG Cloud Architecture for Dynamic Load Management,” in Proceedings of the International Conference on Information Networking.",
      "Yuh-Jyh Hu, Tien-Hsiung Ku, Rong-Hong Jan, Kuochen Wang, Yu-Chee Tseng and Shu-Fen Yang, 2012, “Decision Tree-Based Learning to Predict Patient Controlled Analgesia Consumption and Readjustment,” BMC Medical Informatics and Decision Making. (SCI)",
      "H.C. Shih and K.C. Wang, 2012, 02, “An Adaptive Hybrid Dynamic Power Management Algorithm for Mobile Devices,”Computer Networks, Vol. 56, pp. 548-565. (SCI, EI)",
      "M.H. Wei, K.C. Wang and Y.L. Hsieh, 2011, 11, “A Reliable Routing Scheme Based on Vehicle Moving Similarity for VANETs,” in Proceedings of the 2011 IEEE Region 10 Conference (IEEE TENCON).",
      "K.C. Wang, C.-Y. Huang, S.-J. Lin and Y.D. Lin, 2011, 10, “A Fuzzy Pattern-based Filtering Algorithm for Botnet Detection,” Computer Networks. Vol. 55, pp. 3275-3286. (SCI, EI)",
      "H.F. Ho, K.C. Wang and Y.L. Hsieh, 2011, 09, “Resilient Video Streaming for Urban VANETs,” in Proceedings of the Seventh Workshop on Wireless Ad Hoc and Sensor Networks.",
      "S.H. Shee, T.C. Chang, K.C. Wang and Y.L. Hsieh, 2011, 07, “Efficient Color-theory-based Dynamic Localization for Mobile Wireless Sensor Networks,” Wireless Personal Communications. (SCI Expanded, EI)",
      "Y.L. Hsieh and K.C. Wang, 2011, 05 “Road Layout Adaptive Overlay Multicast for Urban Vehicular Ad Hoc Networks,” in Proceedings of the IEEE Vehicular Technology Conference – Spring, pp. 1-5.",
      "C.-T. Tsai, R.-H. Jan and K.C. Wang, 2010, 03, “Optimal Redundancy Allocation for High Availability Routers,” International Journal of Communication Systems, Vol. 23, pp. 1581-1599. (SCI Expanded) ",
      "L.S. Lee and K.C. Wang, 2010, 02, “Design and Analysis of a Network Assisted Fast Handover Scheme for IEEE 802.16e Networks,” IEEE Transactions on Vehicular Technology, Vol. 59, No. 2, pp. 869-883. (SCI, EI)",
      "C.-T. Tsai, R.-H. Jan and K.C. Wang, 2010, 01, “Design and Implementation of High Availability OSPF Router,” Journal of Information Science and Engineering, Vo. 26, pp. 2173-2198. (SCI Expanded, EI)",
      "C.C. Yang, K.C. Wang, M.H. Lin and P.C. Lin, 2009, 01, “Energy Efficient Intra-Task Dynamic Voltage Scaling for Realistic CPUs of Mobile Devices,” Journal of Information Science and Engineering, Vol. 25, No. 1, pp. 251-272. (SCI Expanded, EI) ",
      "T.J. Chang, K.C. Wang and Y.L. Hsieh, 2008, 02, “A Color-theory-based Energy Efficient Routing Algorithm for Mobile Wireless Sensor Networks,” Computer Networks, Vol. 52, No. 3, pp. 531-541. (SCI, EI)",
      "K.N. Tseng, K.C. Wang and H.C. Shih, 2007, 11, “Enhancing Fair Scheduling for IEEE 802.11e Wireless LANs,” Journal of Information Science and Engineering, Vol. 23, No, 6, pp. 1707-1721. (SCI Expanded, EI)",
      "C.H. Shih, K.C. Wang and H.C. Shih, 2006, 07 “An Adaptive Bluetooth Packet Selection and Scheduling Scheme in Interference Environments,” Computer Communications, pp. 2048-2095. (SCI, EI) ",
      "H.H. Chen, K.C. Wang and H.C. Shih, 2006, 09, “A WAP-based and Push-enabled Mobile Internet Application Platform,” Journal of Information Science and Engineering, pp. 1279-1293. (SCI Expanded, EI) ",
      "T.H. Lin, K.C. Wang, and A.Y. Liu, 2005, 06 “An Efficient Load Balancing Strategy for Scalable WAP Gateways,” Computer Communications, Vol. 28, Issue 9, pp. 1028-1037. (SCI, EI)",
      "L.M. Wu, K.C. Wang and C.Y. Chiu, 2004, 01, “A BNF-based Automatic Test Program Generator for Compatible Microprocessor Verification,” ACM Transactions on Design Automation of Electronic Systems, Vol. 1, No. 9, pp. 105-132. (SCI)",
      "D.S. Chien, K.C. Wang and A.Y. Liu, 2003, 03, “Efficient Web Content Adaptation for Mobile Client Devices in Wireless Internet,” Journal of Computers, Vol. 15, No. 1, pp. 42-56.",
      "K.C. Wang and L.S. Lee, 2001, 07 “Design and Analysis of QoS Supported Frequent Handover Schemes in Micro-Cellular ATM Networks,” IEEE Transactions on Vehicular Technology, Vol. 50, Issue 4, pp. 942-953. (SCI, EI)",
      "K.C. Wang and H.J. Wang, 2001, 03, “Design and Analysis of an ATM Switch with Priority Discarding Scheme,” Journal of Information Science and Engineering, Vol. 17, No. 2, pp. 229-244. (SCI Expanded, EI)",
      "K.C. Wang and M.H. Cheng, 2000, 07, “Design and Analysis of a Gble Multicast ATM Switch,” IEEE Transactions on Communications, Vol. 48, No. 7, pp. 1091-1094. (SCI, EI)",
      "W.D. Tseng and K.C. Wang, 2000, 04 “Fault Coverage and Defect Level Estimation Models for Partially Testable MCMs,” IEE Proceedings – Circuits, Devices and Systems, Vol. 147, No. 2, pp. 119-124. (SCI, EI)",
      "K.C. Wang and J.M. Liao, and J.M. Chen, 2000, 02, “Intelligent Location Tracking Strategy in PCS,” IEE Proceedings – Communications, Vol. 147, No. 1, pp. 63-68. (SCI, EI)",
      "K.C. Wang and A.Y. Liu, 2000, 02 “Design and Performance Evaluation of a Pipelined One-Sided Crossbar Switches,” Journal of the Chinese Institute of Electrical Engineering, Vol. 7, No. 1, pp. 29-40. (SCI Expanded, EI)",
      "K.C. Wang and C.C. Wang, 2000, 01, “A Cost-Effective Forward Recovery Checkpointing Scheme in Multiprocessor Systems,” Journal of Information Science and Engineering, Vol. 16, No. 1, pp. 65-80. (SCI Expanded, EI)",
      "K.C. Wang and J. Huey, 1999, “A Cost Effective Distributed Location Management Strategy for Wireless Networks,” ACM Wireless Networks, Vol. 5, pp. 287-297. (SCI, EI)",
      "K.C. Wang and F.M. Lin, 1999, 07 “Design and Implementation of a Fault Tolerant ATM Switch,” Journal of Information Science and Engineering, Vol. 15, No. 4, pp. 521-541. (SCI Expanded, EI)",
      "K.C. Wang and J.H. Chen, 1999, 07, “An Efficient Probabilistic Dynamic Multicast Routing in ATM Networks,” Journal of Information Science and Engineering, Vol. 15, No. 4, pp.485-504. (SCI Expanded, EI)",
      "W.D. Tseng and K.C. Wang, 1999, 03, “Fuzzy-Based CMOS Circuit Partitioning in Built-In Current Testing,” IEEE Transactions on VLSI Systems, Vol. 7, No. 1, pp. 116-120. (SCI, EI)",
      "K.C. Wang and C.C. Wu, 1999, 02, “A New Goniometry-based Routing Algorithm for ATM Networks,” Journal of the Chinese Institute of Electrical Engineering, Vo. 6, No. 1, pp. 51-61. (SCI Expanded, EI)",
      "K.C. Wang and C.K. Wu, 1999, 01, “Design and Implementation of Fault Tolerant and Cost-Effective Crossbar Switches for Multiprocessor Systems,” IEE Proceedings – Computers and Digital Techniques, Vol. 146, No. 1, pp. 50-56. (SCI, EI)",
      "K.C. Wang and J.W. Lin, 1995, 12, “Integrated Diagnosis and Reconfiguration Process for Yield Enhancement of Large Area VLSI and WSI Arrays,” Journal of Microelectronic Systems Integration, Vol. 3(4), pp. 259-268.",
      "K.C. Wang and S.Y. Kuo, 1994, 06, “System-level Optimal Group Diagnosis Procedures for Defect Tolerant VLSI and WSI Arrays,” Journal of Microelectronic Systems Integration, Vol. 2(2), pp. 81-93.",
      "K.C. Wang and W.D. Tseng, 1993, 12, “Diagnosable Designs and Diagnostic Strategies of Large Area VLSI/WSI Arrays,” Journal of Microelectronic Systems Integration, Vol. 1(4), pp. 259-272.",
      "K.C. Wang and S.Y. Kuo, 1992, 02, “Computer-Aided Modeling and Evaluation of Reconfigurable VLSI Processor Arrays with VHDL,” IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, pp. 185-197. (SCI)",
      "S.Y. Kuo and K.C. Wang, 1990, “Fault Diagnosis in Reconfigurable VLSI and WSI Processor Arrays,” Journal of VLSI Signal Processing, Vol. 2, pp. 173-187. (SCI, EI)",
      "K.C. Wang and S.Y. Kuo, 1989, 11, “Fault Detection and Location in VLSI Arrays,” Proceedings of the 1989 IEEE International Conference on Computer-Aided Design, pp. 234-237.",
      "S.Y. Kuo and K.C. Wang, 1989, 01, “Fault Diagnosis in VLSI/WSI Processor Arrays,” Proceedings of the 1989 IEEE International Conference on Wafer Scale Integration, pp.325-333."
    ]
  },
  {
    "category": "專書及專書論文",
    "content": [
      "P.C. Lin and K.C. Wang, 2010, “An Efficient Low Power Scheduling for Heterogeneous Dual-Core Embedded Real-Time Systems,” A Book Chapter, in Advances in Energy Research, Vol. 1, pp. 241-257, Nova Science Publishers.",
      "Y.Z. Wu and K.C. Wang, 2009, “An Efficient Power Saving MAC Mechanism for VoIP over IEEE 802.11e WLANs,” Nova Science Publishers,” A Book Chapter, in Mobile Computing Research and Applications, pp. 191-203, Nova Science Publishers.",
      "Y.L. Ko, K.C. Wang and H.C. Shih, 2007, “An Efficient Mobile-Agent-Based Platform for Dynamic Service Provisioning in 3G/UMTS,” A Book Chapter, in Wireless Communications Research Trends, pp. 349-370, Nova Science Publishers.",
      "K.C. Wang and C.T. Chang, 2002, “An Intelligent On-Demand Multicast Routing Protocol in Ad Hoc Networks,” A Book Chapter, in The Handbook of Ad Hoc Wireless Networks, pp. 20-1 – 20-15, CRC Press. (EI)"
    ]
  },
  {
    "category": "專利",
    "content": [
      "Flow Entry Aggregation Method and Related Network System, Tsung-Hsien TSAI, Kuo-Chen WANG, Wei-Feng WU, Wei-Tso TSAI, Yu-Han SHIH, Publication number: 20180198719, Publication date: July 12, 2018",
      "NETWORK SYSTEM CONTROL METHOD AND NETWORK SYSTEM RELATED TO AGGREGATION OPERATION USING REDUNDANT FLOW ENTRY, Yu-Ching Ye, Tzu-Yu Chao, Kuo-Chen Wang, Publication number: 20180131603, Publication date: May 10, 2018",
      "Vehicular communication system and routing method thereof, Yi-Ling Hsieh, Kuo-Chen Wang, Patent number: 9674077,Type: Grant, Date of Patent: June 6, 2017, Assignee: National Chiao Tung University.",
      "Data center network flow migration method and system thereof, Wei-Fan Hong, Kuo-Chen Wang, Yu-Chun Yeh, Dean-Chung Wang, Ping-Liang Lin, Patent number: 9467380, Type: Grant, Date of Patent: October 11, 2016, Assignees: Inventec (Pudong) Technology Corp., Inventec Corporation.",
      "應用增強型窗口方法和相互交替型式於純量乘法演算法之橢圓形曲線加密方法，葉宏男、王國禎、簡榮宏，I444028，2014/7/1 ~ 2031/12/22",
      "電源管理系統及其方法，台灣專利，施宏政、王國禎， I428736，2014/3/1 ~ 2031/5/30",
      "伺服器系統與使用者註冊方法，台灣專利，徐偉原、王國禎、簡榮宏、張仲儒，I397296，2013/5/21 ~ 2028/12/17",
      "METHOD OF ELLIPTIC CURVE CRYPTOGRAPHY USING EW-MOF ON SCALAR MULTIPLICATION，葉宏男、王國禎、簡榮宏，US 8,666,076 B2, 2012/4/13 ~ 2032/8/24",
      "DECENTRALIZED STRUCTURED PEER-TO-PEER NETWORK AND LOAD BALANCING METHODS THEREOF，徐崇騵、王國禎、施宏政，US 8,443,086 B2，2011/6/22 ~ 2032/1/13"
    ]
  }
]